doc/1-scope/scope-stakeholders.md
```mermaid
erDiagram
    "game instance" ||--o{ "game session"
    portal ||--|{ "portal admin"
    portal ||--o{ organization
    organization ||-o{ "org admin"
    organization ||-o{ "game session"
    "game session" ||--|{ player
    "game session" ||--|{ facilitator
    "game session" ||--o{ "session admin"
    organization ||--|{ "game session"
    designer }o--o{ "game instance"
    "game session" }o--o{ "game analyst"
```
